configuration/java/load_test_java_read.yml
config:
  target: "http://127.0.0.1:8013"
  plugins:
    # expect: {}  
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 120
      arrivalRate: 50
      name: Sustained load
 
scenarios:
  - name: "Java | Retrieving data"
    flow:
    - get:
        url: "/num-comp-ram"